# IsTemporaryHideIsolateActive Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsTemporaryHideIsolateActive Method
View Class See Also
---
Indicates if the view is temporarily hiding or isolating elements or categories.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsTemporaryHideIsolateActive()
```

Visual Basic
---
```text
Public Function IsTemporaryHideIsolateActive As Boolean
```

Visual C++
---
```text
public:
bool IsTemporaryHideIsolateActive()
```

# ### Return Value
True if elements/categories are being temporarily hidden or isolated, false otherwise.
# See Also
View Class
Autodesk.Revit.DB Namespace